src/test/resources/test.jmx
<jmeterTestPlan version="1.2" properties="1.8">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
                <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
                <longProp name="ThreadGroup.start_time">1157151632000</longProp>
                <stringProp name="ThreadGroup.num_threads">5</stringProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
                    <stringProp name="LoopController.loops">5</stringProp>
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                </elementProp>
                <longProp name="ThreadGroup.end_time">1157151632000</longProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <stringProp name="ThreadGroup.ramp_time">1</stringProp>
            </ThreadGroup>
            <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
                    <collectionProp name="HeaderManager.headers">
                        <elementProp name="" elementType="Header">
                            <stringProp name="Header.value">Mozilla/5.0 (Macintosh; U; PPC Mac OS X; en) AppleWebKit/XX (KHTML, like Gecko) Safari/YY</stringProp>
                            <stringProp name="Header.name">User-Agent</stringProp>
                        </elementProp>
                    </collectionProp>
                </HeaderManager>
                <hashTree/>
                <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                </ConfigTestElement>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="Digg root page" enabled="true">
                    <stringProp name="HTTPSampler.path">/</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="Search for Apple" enabled="true">
                    <stringProp name="HTTPSampler.path">/search</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.metadata">=</stringProp>
                                <stringProp name="Argument.value">Apple</stringProp>
                                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                                <stringProp name="Argument.name">s</stringProp>
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="Search for Microsoft" enabled="true">
                    <stringProp name="HTTPSampler.path">/search</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.metadata">=</stringProp>
                                <stringProp name="Argument.value">Microsoft</stringProp>
                                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                                <stringProp name="Argument.name">s</stringProp>
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="Search for Video" enabled="true">
                    <stringProp name="HTTPSampler.path">/search</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.metadata">=</stringProp>
                                <stringProp name="Argument.value">video</stringProp>
                                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                                <stringProp name="Argument.name">s</stringProp>
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Gaming" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/gaming</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View All" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/all</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Technology" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/technology</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Science" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/science</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Business" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/world_business</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Sports" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/sports</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Videos" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/videos</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="View Entertainment" enabled="true">
                    <stringProp name="HTTPSampler.path">/view/entertainment</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                        <collectionProp name="Arguments.arguments"/>
                    </elementProp>
                    <stringProp name="HTTPSampler.monitor">false</stringProp>
                    <stringProp name="HTTPSampler.domain">www.digg.com</stringProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                </HTTPSampler>
                <hashTree/>
                <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
                    <objProp>
                        <value class="SampleSaveConfiguration">
                            <time>true</time>
                            <latency>true</latency>
                            <timestamp>true</timestamp>
                            <success>true</success>
                            <label>true</label>
                            <code>true</code>
                            <message>true</message>
                            <threadName>true</threadName>
                            <dataType>true</dataType>
                            <encoding>false</encoding>
                            <assertions>true</assertions>
                            <subresults>true</subresults>
                            <responseData>false</responseData>
                            <samplerData>false</samplerData>
                            <xml>true</xml>
                            <fieldNames>false</fieldNames>
                            <responseHeaders>false</responseHeaders>
                            <requestHeaders>false</requestHeaders>
                            <responseDataOnError>false</responseDataOnError>
                            <saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage>
                            <assertionsResultsToSave>0</assertionsResultsToSave>
                        </value>
                        <name>saveConfig</name>
                    </objProp>
                    <boolProp name="ResultCollector.error_logging">false</boolProp>
                </ResultCollector>
                <hashTree/>
                <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
                    <objProp>
                        <value class="SampleSaveConfiguration">
                            <time>true</time>
                            <latency>true</latency>
                            <timestamp>true</timestamp>
                            <success>true</success>
                            <label>true</label>
                            <code>true</code>
                            <message>true</message>
                            <threadName>true</threadName>
                            <dataType>true</dataType>
                            <encoding>false</encoding>
                            <assertions>true</assertions>
                            <subresults>true</subresults>
                            <responseData>false</responseData>
                            <samplerData>false</samplerData>
                            <xml>false</xml>
                            <fieldNames>false</fieldNames>
                            <responseHeaders>false</responseHeaders>
                            <requestHeaders>false</requestHeaders>
                            <responseDataOnError>false</responseDataOnError>
                            <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
                            <assertionsResultsToSave>0</assertionsResultsToSave>
                        </value>
                        <name>saveConfig</name>
                    </objProp>
                    <boolProp name="ResultCollector.error_logging">false</boolProp>
                </ResultCollector>
                <hashTree/>
                <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
                    <objProp>
                        <value class="SampleSaveConfiguration">
                            <time>true</time>
                            <latency>true</latency>
                            <timestamp>true</timestamp>
                            <success>true</success>
                            <label>true</label>
                            <code>true</code>
                            <message>true</message>
                            <threadName>true</threadName>
                            <dataType>true</dataType>
                            <encoding>false</encoding>
                            <assertions>true</assertions>
                            <subresults>true</subresults>
                            <responseData>false</responseData>
                            <samplerData>false</samplerData>
                            <xml>false</xml>
                            <fieldNames>false</fieldNames>
                            <responseHeaders>false</responseHeaders>
                            <requestHeaders>false</requestHeaders>
                            <responseDataOnError>false</responseDataOnError>
                            <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
                            <assertionsResultsToSave>0</assertionsResultsToSave>
                        </value>
                        <name>saveConfig</name>
                    </objProp>
                    <boolProp name="ResultCollector.error_logging">false</boolProp>
                </ResultCollector>
                <hashTree/>
            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>